In [103]:
import pandas as pd 
import numpy as np
from sklearn.linear_model import LinearRegression

In [104]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [105]:
df.isnull().any()

experience                     True
test_score(out of 10)          True
interview_score(out of 10)    False
salary($)                     False
dtype: bool

In [106]:
# word to number
!pip install word2number

Requirement already satisfied: word2number in c:\users\atefeh\anaconda3\lib\site-packages (1.1)

In [107]:
from word2number import w2n
#df.experience = df.experience.astype(object).fillna("zero")
df.experience = df.experience.fillna("zero")

#for i in range(len(df.experience)):
#    df.experience[i] = w2n.word_to_num(df.experience[i])
#print(df.experience)

df.experience = df.experience.apply(w2n.word_to_num)

In [108]:
import math
mean = math.floor(df['test_score(out of 10)'].mean())
df['test_score(out of 10)'].fillna(mean, inplace=True)

In [109]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [110]:
df.isnull().any()

experience                    False
test_score(out of 10)         False
interview_score(out of 10)    False
salary($)                     False
dtype: bool

In [111]:
X = df.drop('salary($)', axis='columns')
X

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    7.0                           7
7          11                    7.0                           8

In [112]:
model = LinearRegression()
model.fit(X, df['salary($)'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

Answer

53713.86 and 93747.79

In [113]:
model.predict([[2, 9, 6]])

array([53713.86677124])

In [114]:
model.predict([[12, 10, 10]])

array([93747.79628651])